"""
Задание 3
Создайте UNIX сокет, который принимает сообщение с двумя числами, разделенными запятой.
Сервер должен конвертировать строковое сообщения в два числа и вычислять его сумму. После
успешного вычисления возвращать ответ клиенту

Задание 4
Изучите основные понятия, рассмотренные в уроке и работу с HTTP протоколам в Python,
используя библиотеки urllib и requests.

Задание 5
Изучите более подробно и попробуйте возможности настройки, pull-а соединений и его режимов.
Используя утилиту ab протестируйте ваши наработки (https://ru.wikipedia.org/wiki/ApacheBench).
Задание 6

"""

# 3   Не применимо, т.к. у меня Windows

# 4    done

# 5    насколько я понял - это уже depricated